{
  "slides": [
    {
      "type": "text",
      "content": "<h3>B1 Conjunctions – Revision and New Forms</h3><p>We have already learned conjunctions like <b>obwohl, dass, ob, wenn</b> in A2.<br><br>Recall:<br>- <b>und, aber, oder</b> are simple conjunctions and do not change the word order or case.<br>- <b>weil, obwohl, wenn, ob, dass, W-Fragen</b> are 'verb pushers' and move the conjugated verb to the end in the second clause. Each clause can have its own subject/object/case.<br><br>Now let's see new B1 conjunctions: <b>deshalb, trotzdem</b>, and more advanced usage of <b>obwohl</b>.</p>"
    },
    {
      "type": "text",
      "content": "<h3>Obwohl at the Beginning of a Sentence</h3><p>When <b>obwohl</b> starts a sentence:<br>1. It pushes the conjugated verb to the end of the first clause.<br>2. The conjugated verb of the second clause comes immediately after the comma (first position).<br><br>Examples:<br>Obwohl ich Deutsch lernen möchte, soll ich selten lernen.<br>Obwohl ich Erkältung habe, trinke ich Bier.<br><br>Note: This order feels more formal or written but is often used in B1/B2 and above.</p>"
    },
    {
      "type": "text",
      "content": "<h3>Deshalb and Trotzdem – KVS Rule</h3><p><b>deshalb</b> = therefore<br><b>trotzdem</b> = nevertheless, even so<br><br>Both follow <b>KVS</b> (Konjunktion, Verb, Subject) word order:<br><br>Examples with deshalb:<br>Ich bin hungrig, deshalb esse ich einen Apfel.<br>Das Wetter ist schön, deshalb gehe ich aus.<br><br>Examples with trotzdem:<br>Ich gehe aus, trotzdem regnet es.<br>Ich esse einen Apfel, trotzdem bin ich nicht hungrig.<br>Note: The verb comes right after the conjunction!</p>"
    },
    {
      "type": "text",
      "content": "<h3>Summary: Deshalb, Trotzdem, Obwohl at the Beginning</h3><p>- <b>obwohl</b> at the start: verb goes to the end of the first clause; next clause starts with verb.<br>- <b>deshalb/trotzdem</b>: follow <b>KVS order</b> (conjunction, verb, subject).<br>- deshalb = therefore; trotzdem = even though/nevertheless.<br>- Practice using these in both written and spoken sentences.</p>"
    }
  ]
}
