{
  "slides": [
    {
      "type": "text",
      "content": "<h3>B1 Lesson 1 – Infinitiv mit zu</h3><p>In German, when making sentences like 'I promise to play today', we use <b>Infinitiv mit zu</b>. This means 'zu' is added before the verb in infinitive form.<br>These sentences have two parts: the first part (main clause) is incomplete alone, and the second part (the activity) completes the meaning.<br>Example:<br>I promise to play today. (The promise needs 'to play today' to make sense.)</p>"
    },
    {
      "type": "text",
      "content": "<h3>When to Use Infinitiv mit zu</h3><p>Conditions for using infinitiv mit zu:<br><ol><li>The subject (person or thing doing the action) must be the same in both parts.<br>Example: I promise to play → 'I' is the subject throughout.</li><li>The first part is incomplete by itself.<br>'I promise' – promise what?</li></ol></p>"
    },
    {
      "type": "text",
      "content": "<h3>How to Make Infinitiv mit zu Sentences</h3><p><ul><li>Step 1: Write the first sentence as it is.</li><li>Step 2: Do not mention the subject again in the second (activity) part.</li><li>Step 3: Move the activity verb to the end in infinitive form, and put 'zu' directly before it (zu spielen).</li><li>If there is a modal verb in the second part, remove it and only use the main verb with 'zu'.</li></ul></p>"
    },
    {
      "type": "text",
      "content": "<h3>Examples</h3><p>I am trying to play today.<br>Check conditions: 'I' is the subject in both, 'I am trying' is not complete.<br>So, we use infinitiv mit zu:<br><i>Ich versuche, heute zu spielen.</i><br>Other examples:<br>I think I should go – <i>Ich denke, gehen zu sollen.</i><br>I forgot to study today – <i>Ich habe vergessen, heute zu lernen.</i><br>I promise to speak the truth – <i>Ich verspreche, die Wahrheit zu sagen.</i></p>"
    },
    {
      "type": "text",
      "content": "<h3>Summary – Infinitiv mit zu</h3><p><ul><li>Used when both parts have same subject and the first part is incomplete without the activity.</li><li>In the second part: remove subject and modal, use 'zu' + infinitive at the end.</li><li>Examples: Ich versuche, heute zu spielen. Ich verspreche, die Wahrheit zu sagen.</li></ul></p>"
    }
  ]
}
